#Написать программу ввода строки и формирования новой строчки вида: "Строка: <введенная строка>. Длина: <длина строки>".
# Результат сформированной строки вывести на экран. В программе F-строки не использовать.
a = input()
print('Строка:', a + '.', 'Длина:', len(a))