# Напишите программу ввода строки и отображения на экране ее первого и последнего символа в виде одной строки.
a = input()
print(a[0] + a[-1])