# Напишите программу отображения последних трех символов из введенной строки.
# Будем полагать, что строка гарантированно длиной не менее трех символов.
a = input()[-3:]
print(a)