# Вводится порядковый номер дня недели (1, 2, ..., 7).
# Вывести на экран его название (понедельник, вторник, среда, четверг, пятница, суббота, воскресенье).
# Программу реализовать с использованием операторов if-elif.
day = int(input())
if day == 1:
    print('Понедельник')
elif day == 2:
    print('Вторник')
elif day == 3:
    print('Среда')
elif day == 4:
    print('Четверг')
elif day == 5:
    print('Пятница')
elif day == 6:
    print('Суббота')
elif day == 7:
    print('Воскресенье')